In [20]:
import pandas as pd
import sqlite3

In [21]:
con = sqlite3.connect('../data/survey.db')

In [22]:
cursor = con.cursor()

In [23]:
cursor.execute("SELECT * FROM Site;")

In [24]:
results = cursor.fetchall()

In [25]:
results

[('DR-1', -49.85, -128.57),
 ('DR-3', -47.15, -126.72),
 ('MSK-4', -48.87, -123.4)]

In [26]:
pd.DataFrame(results)

       0      1       2
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [27]:
cursor.close()
con.close()

In [28]:
con = sqlite3.connect('../data/survey.db')

In [29]:
df = pd.read_sql_query("SELECT * FROM Site;", con)
con.close()

In [30]:
df

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [11]:
a = 3

In [12]:
f"hey, a = {a}"

'hey, a = 3'

In [13]:
# ../data/table4b.csv
# make that dataset "tidy"
df = pd.read_csv('../data/table4b.csv')
df.melt(id_vars='country', value_name='pop', var_name='year')

       country  year         pop
0  Afghanistan  1999    19987071
1       Brazil  1999   172006362
2        China  1999  1272915272
3  Afghanistan  2000    20595360
4       Brazil  2000   174504898
5        China  2000  1280428583

In [14]:
# ../data/table3.csv
# splite the rate column into case_count and population

df = pd.read_csv('../data/table3.csv')
df

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272
5        China  2000  213766/1280428583

In [15]:
df[['count', 'pop']] = df.rate.str.split('/', expand=True)

In [16]:
df

       country  year               rate   count         pop
0  Afghanistan  1999       745/19987071     745    19987071
1  Afghanistan  2000      2666/20595360    2666    20595360
2       Brazil  1999    37737/172006362   37737   172006362
3       Brazil  2000    80488/174504898   80488   174504898
4        China  1999  212258/1272915272  212258  1272915272
5        China  2000  213766/1280428583  213766  1280428583

In [17]:
def parse(x):
    return x.split('/')

In [18]:
df['numerator'] = df.rate.apply(parse).str.get(0)
df['demoninator'] = df.rate.apply(parse).str.get(1)

In [19]:
df

,country,year,rate,count,pop,numerator,demoninator
0,Afghanistan,1999,745/19987071,745,19987071,745,19987071
1,Afghanistan,2000,2666/20595360,2666,20595360,2666,20595360
2,Brazil,1999,37737/172006362,37737,172006362,37737,172006362
3,Brazil,2000,80488/174504898,80488,174504898,80488,174504898
4,China,1999,212258/1272915272,212258,1272915272,212258,1272915272
5,China,2000,213766/1280428583,213766,1280428583,213766,1280428583